src/InformationRegisters/дкл_Полки/дкл_Полки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_Полки</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.дкл_СостоянияПолок</types>
    </type>
  </resources>
  <resources>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ярус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>depth</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Editable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>trayNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/дкл_ВидыАСХ/дкл_ВидыАСХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_ВидыАСХ</name>
  <enumValues>
    <name>Карусель</name>
  </enumValues>
  <enumValues>
    <name>Лифт</name>
  </enumValues>
  <enumValues>
    <name>ТяжелыйЛифт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/дкл_НастройкиСкладовЛифтов/дкл_НастройкиСкладовЛифтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>дкл_НастройкиСкладовЛифтов</name>
  <attributes>
    <name>machineId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтодобавлениеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтопереводОрдеровВСтатусReady</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМеханики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАСХ</name>
    <type>
      <types>EnumRef.дкл_ВидыАСХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонВыдачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоположениеWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоУстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОповещений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.дкл_СпособПодключения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиОповещений</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПолки</name>
    <attributes>
      <name>trayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>title</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>width</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>depth</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>barcode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ярус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/дкл_Полки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "дкл_СписокНастроекСкладовЛифтов" Тогда
		 ОбновитьСтатусЛифта();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НомерСтатусаЛифта = 0;
	БлокироватьКнопки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  

	дкл_ФормыКлиент.ЗаблокироватьКнопки(ЭтотОбъект);    

	УстановитьВидимостьДоступность();
	УстановитьОтбор();         
	УстановитьЗоныВыбораИВидАСХ(); 
	
	Если НЕ дкл_ФормыВызовСервера.ПроверитьСтрокуСоединения(НастройкаСкладаЛифта) Тогда
		Возврат;	
	КонецЕсли;

	ВерсияПО = дкл_ФормыВызовСервера.ВерсияПО(НастройкаСкладаЛифта);
	
	Если ВерсияПО = "1.6" ИЛИ Лев(ВерсияПО, 2) = "2." Тогда
		
		ОбновлениеСтатусов();
		
		СлучайноеЧисло = 15;
		
		#Если НЕ ВебКлиент Тогда 
			ГСЧ = Новый ГенераторСлучайныхЧисел();
			СлучайноеЧисло = ГСЧ.СлучайноеЧисло(1500, 2500) / 100;
		#КонецЕсли  
		
		Если дкл_ФормыВызовСервера.ПроверитьСоединение(НастройкаСкладаЛифта) Тогда
			ЕстьСоединение = Истина;
			ПодключитьОбработчикОжидания("ОбновлениеСтатусов", СлучайноеЧисло, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаСкладаЛифтаПриИзменении(Элемент)
	
	НомерСтатусаЛифта = 0;
	
	дкл_ФормыКлиент.ЗаблокироватьКнопки(ЭтотОбъект);
	
	ВерсияПО = дкл_ФормыВызовСервера.ВерсияПО(НастройкаСкладаЛифта);

	Возвращена.Очистить();
	Выдана.Очистить();
	Ошибка.Очистить();

	ОбновлениеСтатусов();
	
	УстановитьВидимостьДоступность();
	УстановитьОтбор();
	УстановитьЗоныВыбораИВидАСХ();  
	
	дкл_ФормыКлиент.УстановитьДоступностьКнопокДляТекущейПолки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	дкл_ФормыКлиент.УстановитьДоступностьКнопокДляТекущейПолки(ЭтотОбъект);
	ТекушаяСтрока = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекушаяСтрока = Неопределено Тогда
		Элементы.ТекущийНомерПолки.Заголовок = "№ полки: " + ТекушаяСтрока.trayNumber;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	ОбновлениеСтатусов();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратПолки(Команда)

	дкл_ФормыКлиент.ЗаблокироватьКнопки(ЭтотОбъект);
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	trayNumber = ТекущиеДанные.trayNumber;
	
	ПоместитьНомерПолкиВСписок(trayNumber, "Перемещается");
	Элементы.Список.Обновить();   

	ПодключитьОбработчикОжидания("ВозвратПолкиПродолжение", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаПолки(Команда)

	дкл_ФормыКлиент.ЗаблокироватьКнопки(ЭтотОбъект);
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;      

	trayNumber = ТекущиеДанные.trayNumber;
	
	ПоместитьНомерПолкиВСписок(trayNumber, "Перемещается");
	Элементы.Список.Обновить();   
	
	ПодключитьОбработчикОжидания("ВыдачаПолкиПродолжение", 1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновлениеСтатусов() Экспорт
	
	дкл_ФормыКлиент.ЗаблокироватьКнопки(ЭтотОбъект);

	ОбновитьСтатусЛифта(); 
	
	ОбновитьСтатусаПолокНаСервере(НастройкаСкладаЛифта);  
	
	дкл_ФормыКлиент.РазблокироватьКнопки(ЭтотОбъект);
	
	дкл_ФормыКлиент.УстановитьДоступностьКнопокДляТекущейПолки(ЭтотОбъект);
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусаПолокНаСервере(НастройкаСкладаЛифта)
	
	Если ВерсияПО = "1.6" ИЛИ Лев(ВерсияПО, 2) = "2." Тогда
		Выдана.ЗагрузитьЗначения(
			РегистрыСведений.дкл_Полки.НомераВыданныхПолок(НастройкаСкладаЛифта));
	КонецЕсли;

	Ошибка.Очистить();
	Перемещается.Очистить();
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЛифта()         
	дкл_ФормыКлиент.ОбновитьСтатусЛифта(ЭтотОбъект);
КонецПроцедуры  

&НаКлиенте
Процедура ВыдачаПолкиПродолжение() Экспорт

	requestId = Неопределено;
	
	Ответ = дкл_ФормыВызовСервера.ВыдачаПолкиНаСервере(НастройкаСкладаЛифта, trayNumber, requestId, ЗонаВыдачи);
	
	Если Ответ = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	Если Ответ.Статус = 0 Тогда // выполняется, 1 - выполнено, 2 и больше - ошибка
		
		Сч = 0;
		
		Пока Ответ.Статус = 0 И Сч < 100 Цикл

			Ответ = дкл_ФормыВызовСервера.СостояниеЗапросНаСервере(НастройкаСкладаЛифта, requestId);
			
			Сч = Сч + 1;               

		КонецЦикла;
		
	КонецЕсли;
	
	Если Ответ = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Ответ.Статус = 1 Тогда
		Выдана.Очистить();
		Ошибка.Очистить();
		ПоместитьНомерПолкиВСписок(trayNumber, "Выдана");
		// подкрасить лифт зеленым...            
		НомерСтатуса = 2;
		УстановитьКартинкуБезПроверкиСкладаЛифта(НомерСтатуса)         
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ответ.Текст);     
		ПоместитьНомерПолкиВСписок(trayNumber, "Ошибка");
		// подкрасить лифт желтым...
		НомерСтатуса = 3;
		УстановитьКартинкуБезПроверкиСкладаЛифта(НомерСтатуса)         
	КонецЕсли;

	Элементы.Список.Обновить();   
	
	дкл_ФормыКлиент.РазблокироватьКнопки(ЭтотОбъект);
	
	дкл_ФормыКлиент.УстановитьДоступностьКнопокДляТекущейПолки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратПолкиПродолжение() Экспорт

	requestId = Неопределено;

	Ответ = дкл_ФормыВызовСервера.ВозвратПолкиНаСервере(НастройкаСкладаЛифта, trayNumber, requestId);
	
	Если Ответ = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Ответ.Статус = 0 Тогда // выполняется
		
		Сч = 0;
		
		Пока НЕ Ответ.Статус = 0 И Сч < 60 Цикл

			Ответ = дкл_ФормыВызовСервера.СостояниеЗапросНаСервере(НастройкаСкладаЛифта, requestId);
			
			Сч = Сч + 1;               

			Если Ответ.Статус = 2 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Ответ = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ Ответ.Статус = 0 И НЕ Ответ.Статус = 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ответ.Текст);     
		ПоместитьНомерПолкиВСписок(trayNumber, "Ошибка");
	Иначе                                                             
		ПоместитьНомерПолкиВСписок(trayNumber, "Возвращена");
	КонецЕсли;
	
	дкл_ФормыКлиент.РазблокироватьКнопки(ЭтотОбъект);
	
	дкл_ФормыКлиент.УстановитьДоступностьКнопокДляТекущейПолки(ЭтотОбъект);

	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()         

	Если ВерсияПО = "1.4" Тогда
		Элементы.ФормаВозвратПолки.Видимость = Ложь;
	Иначе
		Элементы.ФормаВозвратПолки.Видимость = Истина;
	КонецЕсли;

	// Добавляем чек-бокс "Управление через 1с". 
	// Если он включен, 
	// то тогда пользователь из 1с может вызывать 
	// и возвращать полки на данном Лифте.
	
	дкл_ФормыСервер.УстановитьВидимостьДоступностьДляПользователя(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()         
	
	Отбор = Список.КомпоновщикНастроек.Настройки.Отбор;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Отбор, "НастройкаСклада");

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "НастройкаСклада", НастройкаСкладаЛифта, ВидСравненияКомпоновкиДанных.Равно, Истина);   

	Список.Параметры.УстановитьЗначениеПараметра("Ошибка"		, Ошибка);
	Список.Параметры.УстановитьЗначениеПараметра("Выдана"		, Выдана);
	Список.Параметры.УстановитьЗначениеПараметра("Перемещается"	, Перемещается);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьЗоныВыбораИВидАСХ()         
	
	КоличествоЗонВыдачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСкладаЛифта, "КоличествоЗонВыдачи");		
	КоличествоЗонВыдачи = ?(НЕ ЗначениеЗаполнено(КоличествоЗонВыдачи), 1, КоличествоЗонВыдачи);   

	ЗонаВыдачи = 1;
	
	Если КоличествоЗонВыдачи = 1 Тогда
		Элементы.ЗонаВыдачи.Видимость = Ложь;
	Иначе
		Элементы.ЗонаВыдачи.Видимость = Истина;
	КонецЕсли;

	ВидАСХ = Справочники.дкл_НастройкиСкладовЛифтов.ВидАСХ(НастройкаСкладаЛифта);
	
	Если ВидАСХ = Перечисления.дкл_ВидыАСХ.Карусель Тогда
		ДоступнаТолькоВыдачаПолки = Истина;
	Иначе
		ДоступнаТолькоВыдачаПолки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинкуБезПроверкиСкладаЛифта(НомерСтатуса)         

	Если НомерСтатуса = 2 Тогда
		Элементы.Картинка.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
	ИначеЕсли НомерСтатуса = 3 Тогда
		Элементы.Картинка.Картинка = БиблиотекаКартинок.ОформлениеКругЖелтый;
	Иначе
		Элементы.Картинка.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
	КонецЕсли;            
	
КонецПроцедуры        

&НаСервере
Процедура ПоместитьНомерПолкиВСписок(НомерПолки, ИмяСписка)

	МассивИмяСписков = Новый Массив;
	МассивИмяСписков.Добавить("Ошибка");
	МассивИмяСписков.Добавить("Выдана");
	МассивИмяСписков.Добавить("Перемещается");
	
	Для каждого ИмяИзМассива Из МассивИмяСписков Цикл
		Если ИмяИзМассива = ИмяСписка Тогда
			Если ЭтотОбъект[ИмяСписка].НайтиПоЗначению(НомерПолки) = Неопределено Тогда
				ЭтотОбъект[ИмяСписка].Добавить(НомерПолки);
			КонецЕсли;
		Иначе			                                             
			НайденныйЭлементСписка = ЭтотОбъект[ИмяИзМассива].НайтиПоЗначению(НомерПолки);
			Если НЕ НайденныйЭлементСписка = Неопределено Тогда
				ЭтотОбъект[ИмяИзМассива].Удалить(НайденныйЭлементСписка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти
